pen = 10
pencil = 5
ruler =15
eraser=8
pencilcase=120
usernameinput = input("UserName : ")
passwordinput = input("Password : ")
if usernameinput == "admin" and passwordinput == "0000":
    print("-------------------------------------------")
    print("**************** ร้านใจสดชื่น *****************")
    print("     ยินดีตอนรับเข้าสู่โปรแกรมคำนวณราคาเครื่องเขียน")
    print("-------------------------------------------")
    print("รายการเครื่องเขียน :")
    print("1. ปากกา     1 แท่ง       ราคา :",pen,"บาท")
    print("2. ดินสอ      1 แท่ง       ราคา :",pencil,"บาท")
    print("3. ไม้บรรทัด   1 อัน        ราคา :",ruler,"บาท")
    print("4. ยางลบ     1 อัน        ราคา :", eraser,"บาท")
    print("5. กล่องดินสอ  1 อัน        ราคา :",pencilcase,"บาท")
    print("-------------------------------------------")
    CusumerSelected = int(input("กรุณาเลือกรายการสินค้าทีท่านต้องการ :"))
    if CusumerSelected == 1:
        print("สินค้าที่ท่านเลือก : ปากกา")
        Number = int(input("จำนวนสินค้าที่ต้องการ (แท่ง) :"))
        print("-------------------------------------------")
        print("ราคาทั้งหมด :",pen*Number,"บาท")
        print("-------------------------------------------")
        print("ขอบคุณที่ใช้บริการค่ะ")
    elif CusumerSelected == 2:
        print("สินค้าที่ท่านเลือก : ดินสอ")
        Number = int(input("จำนวนสินค้าที่ต้องการ (แท่ง) :"))
        print("-------------------------------------------")
        print("ราคาทั้งหมด :", pencil * Number, "บาท")
        print("-------------------------------------------")
        print("ขอบคุณที่ใช้บริการค่ะ")
    elif CusumerSelected == 3:
        print("สินค้าที่ท่านเลือก : ไม้บรรทัด")
        Number = int(input("จำนวนสินค้าที่ต้องการ (อัน) :"))
        print("-------------------------------------------")
        print("ราคาทั้งหมด :", ruler * Number, "บาท")
        print("-------------------------------------------")
        print("ขอบคุณที่ใช้บริการค่ะ")
    elif CusumerSelected == 4:
        print("สินค้าที่ท่านเลือก : ยางลบ")
        Number = int(input("จำนวนสินค้าที่ต้องการ (ก้อน) :"))
        print("-------------------------------------------")
        print("ราคาทั้งหมด :", eraser * Number, "บาท")
        print("-------------------------------------------")
        print("ขอบคุณที่ใช้บริการค่ะ")
    elif CusumerSelected == 5:
        print("สินค้าที่ท่านเลือก : กล่องดินสอ")
        Number = int(input("จำนวนสินค้าที่ต้องการ (อัน) :"))
        print("-------------------------------------------")
        print("ราคาทั้งหมด :", pencilcase * Number, "บาท")
        print("-------------------------------------------")
        print("ขอบคุณที่ใช้บริการค่ะ")
    else:
        print("รายการที่คุณเลือกไม่ถูกต้อง กรุณาตรวจสอบอีกครั้ง")
 else:
   print("เตือน!! Username หรือ Password ไม่ถูกต้อง")
